In [98]:
import pandas as pd

In [99]:
titanic = pd.read_csv('C:\Users\sanju\Desktop\\titanic\\titanic.csv')
titanic.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [100]:
titanic.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,NaN,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,NaN,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,NaN,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [101]:
titanic.Age = titanic.Age.fillna(titanic.Age.median())

In [102]:
titanic.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,891.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.361582,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,13.019697,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,22.000000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,35.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [103]:
titanic.loc[titanic.Sex == 'male','Sex'] = 0
titanic.loc[titanic.Sex == 'female','Sex'] = 1

In [104]:
titanic.Sex.tail()

886    0
887    1
888    1
889    0
890    0
Name: Sex, dtype: object

In [105]:
titanic.Embarked = titanic.Embarked.fillna('S')

In [108]:
titanic.loc[829,'Embarked']

0

In [109]:
titanic.loc[titanic.Embarked == 'S','Embarked'] = 0
titanic.loc[titanic.Embarked == 'C','Embarked'] = 1
titanic.loc[titanic.Embarked == 'Q','Embarked'] = 2

In [110]:
# after cleaning
titanic.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",0,22.0,1,0,A/5 21171,7.2500,NaN,0
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,38.0,1,0,PC 17599,71.2833,C85,1
2,3,1,3,"Heikkinen, Miss. Laina",1,26.0,0,0,STON/O2. 3101282,7.9250,NaN,0
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,35.0,1,0,113803,53.1000,C123,0
4,5,0,3,"Allen, Mr. William Henry",0,35.0,0,0,373450,8.0500,NaN,0

In [111]:
titanic['predictions'] = 0

In [112]:
titanic.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare,predictions
count,891.000000,891.000000,891.000000,891.000000,891.000000,891.000000,891.000000,891.0
mean,446.000000,0.383838,2.308642,29.361582,0.523008,0.381594,32.204208,0.0
std,257.353842,0.486592,0.836071,13.019697,1.102743,0.806057,49.693429,0.0
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000,0.0
25%,223.500000,0.000000,2.000000,22.000000,0.000000,0.000000,7.910400,0.0
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200,0.0
75%,668.500000,1.000000,3.000000,35.000000,1.000000,0.000000,31.000000,0.0
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200,0.0

In [113]:
for index in range(0,891):
    if(titanic.Age[index]*(-2)+20>0):
        titanic.predictions[index] = 1
    else:
        titanic.predictions[index] = 0

C:\Users\sanju\Anaconda2\lib\site-packages\ipykernel\__main__.py:5: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
C:\Users\sanju\Anaconda2\lib\site-packages\ipykernel\__main__.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  app.launch_new_instance()

In [116]:
print titanic.predictions.value_counts()
print titanic.Survived.value_counts()

0    829
1     62
Name: predictions, dtype: int64
0    549
1    342
Name: Survived, dtype: int64

In [117]:
titanic = titanic.drop('predictions',1)
titanic.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",0,22.0,1,0,A/5 21171,7.2500,NaN,0
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,38.0,1,0,PC 17599,71.2833,C85,1
2,3,1,3,"Heikkinen, Miss. Laina",1,26.0,0,0,STON/O2. 3101282,7.9250,NaN,0
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,35.0,1,0,113803,53.1000,C123,0
4,5,0,3,"Allen, Mr. William Henry",0,35.0,0,0,373450,8.0500,NaN,0

In [118]:
from sklearn.linear_model import LinearRegression
from sklearn.cross_validation import cross_val_score

In [119]:
type(titanic)

pandas.core.frame.DataFrame

In [183]:
features = titanic[['Sex','Age','SibSp', 'Embarked','Parch']].values
target = titanic['Survived'].values

In [184]:
print features.shape
print target.shape

(891L, 5L)
(891L,)

In [185]:
from sklearn.neighbors import KNeighborsClassifier
from sklearn.linear_model import LogisticRegression

In [186]:
knn = KNeighborsClassifier()
log_reg = LogisticRegression()

In [187]:
#knn accuracy
knn_scores = cross_val_score(knn,features,target,cv = 10,scoring = 'accuracy')
print knn_scores.mean()

0.755400068097

In [188]:
#logistic regression accuracy
log_reg_scores = cross_val_score(log_reg,features,target,cv = 10,scoring = 'accuracy')
print log_reg_scores.mean()

0.790081716037

### Till now we trained data and predicted it on itslef now we use the classifier to predict on testing data

In [189]:
test = pd.read_csv('C:\Users\sanju\Desktop\\titanic\\test.csv')
test.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [190]:
test.loc[test.Sex == 'male','Sex'] = 0
test.loc[test.Sex == 'female','Sex'] = 1

In [191]:
test.Age = test.Age.fillna(test.Age.median())
test.Embarked = test.Embarked.fillna('S')

In [192]:
test.loc[test.Embarked == 'S','Embarked'] = 0
test.loc[test.Embarked == 'C','Embarked'] = 1
test.loc[test.Embarked == 'Q','Embarked'] = 2

In [193]:
test.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",0,34.5,0,0,330911,7.8292,NaN,2
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",1,47.0,1,0,363272,7.0000,NaN,0
2,894,2,"Myles, Mr. Thomas Francis",0,62.0,0,0,240276,9.6875,NaN,2
3,895,3,"Wirz, Mr. Albert",0,27.0,0,0,315154,8.6625,NaN,0
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",1,22.0,1,1,3101298,12.2875,NaN,0

In [194]:
test.describe()

       PassengerId      Pclass         Age       SibSp       Parch        Fare
count   418.000000  418.000000  418.000000  418.000000  418.000000  417.000000
mean   1100.500000    2.265550   29.599282    0.447368    0.392344   35.627188
std     120.810458    0.841838   12.703770    0.896760    0.981429   55.907576
min     892.000000    1.000000    0.170000    0.000000    0.000000    0.000000
25%     996.250000    1.000000   23.000000    0.000000    0.000000         NaN
50%    1100.500000    3.000000   27.000000    0.000000    0.000000         NaN
75%    1204.750000    3.000000   35.750000    1.000000    0.000000         NaN
max    1309.000000    3.000000   76.000000    8.000000    9.000000  512.329200

In [195]:
test_features = test[['Sex','Age','SibSp','Embarked','Parch']]

In [196]:
knn.fit(features,target)
log_reg.fit(features,target)

LogisticRegression(C=1.0, class_weight=None, dual=False, fit_intercept=True,
          intercept_scaling=1, max_iter=100, multi_class='ovr', n_jobs=1,
          penalty='l2', random_state=None, solver='liblinear', tol=0.0001,
          verbose=0, warm_start=False)

In [197]:
test_target_knn = knn.predict(test_features)
test_target_log_reg = log_reg.predict(test_features)

In [198]:
from sklearn import metrics

In [199]:
type(test_target_knn)

numpy.ndarray

In [200]:
output = pd.read_csv('C:\Users\sanju\Desktop\\titanic\\test.csv')

In [201]:
output.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [202]:
output = output.drop(output.columns[1:],axis = 1)
print output.shape

(418, 1)

In [208]:
output['Survived'] = pd.Series(test_target_log_reg)

In [209]:
output.Survived.value_counts()

0    269
1    149
Name: Survived, dtype: int64

In [210]:
output.to_csv('submission.csv',index = False)